org/work-expirience.org

#+HTML: <div class="workentry">

#+HTML: <div class="workname">
ООО Автоматон
#+HTML: </div>

#+HTML: <div class="worktime">
(c 2015-12-01 по настоящее время)
#+HTML: </div>

#+HTML: <div class="workposition">
Руководитель разработки ПО, Системный архитектор
#+HTML: </div>

#+HTML: <div class="workdescr">

    - Спроектировал программно-аппаратную архитектуру системы автоматизации платных парковок.
    - Спланировал и организовал работы по разработке ПО и аппаратной части, включая подбор электронных компонентов и схемотехническое проектирование.
    - Самостоятельно реализовал бизнес-логику и уровень представления (АРМ Оператора)
    - Руководил работами по реализации транспортного уровня и уровня абстракции оборудования, выполненными удаленными разработчиками.
    - Внедрил Continuous Integration и процесс управления жизненным циклом (релизы, исправление ошибок, добавление возможностей, технический контроль качества, автоматизированное тестирование)
    - Реализовал безопасное (цифровая подпись) и отказоустойчивое (откат на предыдующую версию при провале тестов) обновление прошивок через интернет.
    - Автоматизировал создание и хранение документации, с использованием версионирования на базе GIT и "executable specifications".
#+HTML: </div>

#+HTML: </div>

#+HTML: <div class="workentry">

#+HTML: <div class="workname">
ООО БКН
#+HTML: </div>

#+HTML: <div class="worktime">
(c 2015-04-01 по 2015-12-01)
#+HTML: </div>

#+HTML: <div class="workposition">
ИТ-директор
#+HTML: </div>

#+HTML: <div class="workdescr">
Руководил разработкой информационных решений автоматизации бизнеса агентств недвижимости (b2b и b2c). C# и ASP.NET
#+HTML: </div>

#+HTML: </div>

#+HTML: <div class="workentry">

#+HTML: <div class="workname">
Тренд
#+HTML: </div>

#+HTML: <div class="worktime">
(c 2014-08-01 по 2015-03-01)
#+HTML: </div>

#+HTML: <div class="workposition">
Ведущий инженер-программист
#+HTML: </div>

#+HTML: <div class="workdescr">
Автоматизировал бизнес-процесс агенства по продажам недвижимости (новостройки)
#+HTML: </div>

#+HTML: </div>

#+HTML: <div class="workentry">

#+HTML: <div class="workname">
Частная компания (алготрейдинг)
#+HTML: </div>

#+HTML: <div class="worktime">
(c 2012-04-01 по 2014-08-01)
#+HTML: </div>

#+HTML: <div class="workposition">
Lisp/Erlang-разработчик
#+HTML: </div>

#+HTML: <div class="workdescr">
Разрабатывал решения в сфере электронных валют
#+HTML: </div>

#+HTML: </div>

#+HTML: <div class="workentry">

#+HTML: <div class="workname">
ООО РАВТА
#+HTML: </div>

#+HTML: <div class="worktime">
(c 2012-01-01 по 2012-04-01)
#+HTML: </div>

#+HTML: <div class="workposition">
Директор по IT
#+HTML: </div>

#+HTML: <div class="workdescr">
Осуществлял руководство разработкой информационной системы предприятия, занимался постановкой задач и контролем выполнения работ. Организовывал договорную работу с подрядчиками.
#+HTML: </div>

#+HTML: </div>

#+HTML: <div class="workentry">

#+HTML: <div class="workname">
WizardSoft
#+HTML: </div>

#+HTML: <div class="worktime">
(c 2011-05-01 по 2012-01-01)
#+HTML: </div>

#+HTML: <div class="workposition">
Ведущий разработчик, архитектор
#+HTML: </div>

#+HTML: <div class="workdescr">
Разработка высоконагрузочного портала для проведения строительных тендеров. Прототип реализовал на Common Lisp, Postmodern и PostgreSQL. После приемки прототип был существенно расширен и переписан на PHP
#+HTML: </div>

#+HTML: </div>

#+HTML: <div class="workentry">

#+HTML: <div class="workname">
ЦиFры
#+HTML: </div>

#+HTML: <div class="worktime">
(c 2009-09-01 по 2011-04-01)
#+HTML: </div>

#+HTML: <div class="workposition">
Архитектор-проектировщик, веб-программист
#+HTML: </div>

#+HTML: <div class="workdescr">
Перепроектировал и реализовал на высоконагрузочный интернет-магазин.
    Стек технологий: PHP, MySql, Jquery, Common Lisp, Memcached
#+HTML: </div>

#+HTML: </div>

#+HTML: <div class="workentry">

#+HTML: <div class="workname">
ООО Вебдом
#+HTML: </div>

#+HTML: <div class="worktime">
(c 2007-01-01 по 2009-09-01)
#+HTML: </div>

#+HTML: <div class="workposition">
Ведущий веб-разработчик
#+HTML: </div>

#+HTML: <div class="workdescr">
Cпроектировал и разработал масштабируемый фреймворк, на котором теперь работает компания. CMS на его основе поставляются клиентам.
#+HTML: </div>

#+HTML: </div>

#+HTML: <div class="workentry">

#+HTML: <div class="workname">
Почин
#+HTML: </div>

#+HTML: <div class="worktime">
(c 2005-09-01 по 2007-01-01)
#+HTML: </div>

#+HTML: <div class="workposition">
Программист
#+HTML: </div>

#+HTML: <div class="workdescr">
Спроектировал и разработал интернет-магазин на стеке технологий LAMP
#+HTML: </div>

#+HTML: </div>
