public_html/other/work-expirience.html
<div class="workentry">

<div class="workname">
<p>
ООО Автоматон
</p>
</div>

<div class="worktime">
<p>
(c 2015-12-01 по настоящее время)
</p>
</div>

<div class="workposition">
<p>
Руководитель разработки ПО, Системный архитектор
</p>
</div>

<div class="workdescr">

<ul class="org-ul">
<li>Спроектировал программно-аппаратную архитектуру системы автоматизации платных парковок.
</li>
<li>Спланировал и организовал работы по разработке ПО и аппаратной части, включая подбор электронных компонентов и схемотехническое проектирование.
</li>
<li>Самостоятельно реализовал бизнес-логику и уровень представления (АРМ Оператора)
</li>
<li>Руководил работами по реализации транспортного уровня и уровня абстракции оборудования, выполненными удаленными разработчиками.
</li>
<li>Внедрил Continuous Integration и процесс управления жизненным циклом (релизы, исправление ошибок, добавление возможностей, технический контроль качества, автоматизированное тестирование)
</li>
<li>Реализовал безопасное (цифровая подпись) и отказоустойчивое (откат на предыдующую версию при провале тестов) обновление прошивок через интернет.
</li>
<li>Автоматизировал создание и хранение документации, с использованием версионирования на базе GIT и "executable specifications".
</li>
</ul>
</div>

</div>

<div class="workentry">

<div class="workname">
<p>
ООО БКН
</p>
</div>

<div class="worktime">
<p>
(c 2015-04-01 по 2015-12-01)
</p>
</div>

<div class="workposition">
<p>
ИТ-директор
</p>
</div>

<div class="workdescr">
<p>
Руководил разработкой информационных решений автоматизации бизнеса агентств недвижимости (b2b и b2c). C# и ASP.NET
</p>
</div>

</div>

<div class="workentry">

<div class="workname">
<p>
Тренд
</p>
</div>

<div class="worktime">
<p>
(c 2014-08-01 по 2015-03-01)
</p>
</div>

<div class="workposition">
<p>
Ведущий инженер-программист
</p>
</div>

<div class="workdescr">
<p>
Автоматизировал бизнес-процесс агенства по продажам недвижимости (новостройки)
</p>
</div>

</div>

<div class="workentry">

<div class="workname">
<p>
Частная компания (алготрейдинг)
</p>
</div>

<div class="worktime">
<p>
(c 2012-04-01 по 2014-08-01)
</p>
</div>

<div class="workposition">
<p>
Lisp/Erlang-разработчик
</p>
</div>

<div class="workdescr">
<p>
Разрабатывал решения в сфере электронных валют
</p>
</div>

</div>

<div class="workentry">

<div class="workname">
<p>
ООО РАВТА
</p>
</div>

<div class="worktime">
<p>
(c 2012-01-01 по 2012-04-01)
</p>
</div>

<div class="workposition">
<p>
Директор по IT
</p>
</div>

<div class="workdescr">
<p>
Осуществлял руководство разработкой информационной системы предприятия, занимался постановкой задач и контролем выполнения работ. Организовывал договорную работу с подрядчиками.
</p>
</div>

</div>

<div class="workentry">

<div class="workname">
<p>
WizardSoft
</p>
</div>

<div class="worktime">
<p>
(c 2011-05-01 по 2012-01-01)
</p>
</div>

<div class="workposition">
<p>
Ведущий разработчик, архитектор
</p>
</div>

<div class="workdescr">
<p>
Разработка высоконагрузочного портала для проведения строительных тендеров. Прототип реализовал на Common Lisp, Postmodern и PostgreSQL. После приемки прототип был существенно расширен и переписан на PHP
</p>
</div>

</div>

<div class="workentry">

<div class="workname">
<p>
ЦиFры
</p>
</div>

<div class="worktime">
<p>
(c 2009-09-01 по 2011-04-01)
</p>
</div>

<div class="workposition">
<p>
Архитектор-проектировщик, веб-программист
</p>
</div>

<div class="workdescr">
<p>
Перепроектировал и реализовал на высоконагрузочный интернет-магазин.
    Стек технологий: PHP, MySql, Jquery, Common Lisp, Memcached
</p>
</div>

</div>

<div class="workentry">

<div class="workname">
<p>
ООО Вебдом
</p>
</div>

<div class="worktime">
<p>
(c 2007-01-01 по 2009-09-01)
</p>
</div>

<div class="workposition">
<p>
Ведущий веб-разработчик
</p>
</div>

<div class="workdescr">
<p>
Cпроектировал и разработал масштабируемый фреймворк, на котором теперь работает компания. CMS на его основе поставляются клиентам.
</p>
</div>

</div>

<div class="workentry">

<div class="workname">
<p>
Почин
</p>
</div>

<div class="worktime">
<p>
(c 2005-09-01 по 2007-01-01)
</p>
</div>

<div class="workposition">
<p>
Программист
</p>
</div>

<div class="workdescr">
<p>
Спроектировал и разработал интернет-магазин на стеке технологий LAMP
</p>
</div>

</div>
